АлогистикТест2/src/Documents/алк_РучноеИзменениеПараметровПакета/алк_РучноеИзменениеПараметровПакета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РучноеИзменениеПараметровПакета</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСостав1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика1</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемТаможня1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНеттоТаможня1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБруттоТаможня1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатFSC1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат1</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница1</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка1</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>Габарит1</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭО1</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сухой1</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Припуск1</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_РучноеИзменениеПараметровПакета/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(РучноеИзменениеПараметров, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.НомерПакета,
	|	алк_РучноеИзменениеПараметровПакета.ПериодПакета,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.КоличествоСостав1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.КоличествоСостав
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.КоличествоСостав1
	|	КОНЕЦ КАК КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC КАК СертификатFSC1,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ОбъемТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ОбъемТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ОбъемТаможня1
	|	КОНЕЦ КАК ОбъемТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1
	|	КОНЕЦ КАК ВесНеттоТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1
	|	КОНЕЦ КАК ВесБруттоТаможня,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC1 КАК СертификатFSC,
	|	алк_РучноеИзменениеПараметровПакета.ПериодУпаковки,
	|	&Период,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.Габарит1 КАК Габарит,
	|	алк_РучноеИзменениеПараметровПакета.КатегорияНоменклатурыПЭО1 КАК КатегорияНоменклатурыПЭО,
	|	алк_РучноеИзменениеПараметровПакета.Сухой1 КАК Сухой,
	|	алк_РучноеИзменениеПараметровПакета.Припуск1 КАК Припуск
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница1 КАК СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1.Владелец КАК Номенклатура,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав1 КАК Количество,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка1 КАК Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ) КАК ДатаСмены,
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияРасход,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика.Владелец,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ),
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	|	алк_ОстаткиЗапасовОстатки.Штабель
	|ПОМЕСТИТЬ ВТ_СкладШтабель
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&Период,
	|			СерийныйНомер В
	|				(ВЫБРАТЬ
	|					алк_РучноеИзменениеПараметровПакета.СерийныйНомер
	|				ИЗ
	|					Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|				ГДЕ
	|					алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка)) КАК алк_ОстаткиЗапасовОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	ВТ_СкладШтабель.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_СкладШтабель.Штабель КАК Штабель,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1.Владелец КАК Номенклатура,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Количество
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладШтабель КАК ВТ_СкладШтабель
	|		ПО алк_РучноеИзменениеПараметровПакета.СерийныйНомер = ВТ_СкладШтабель.СерийныйНомер
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияРасход,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	ВТ_СкладШтабель.СтруктурнаяЕдиница,
	|	ВТ_СкладШтабель.Штабель,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика.Владелец,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.Объем
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладШтабель КАК ВТ_СкладШтабель
	|		ПО алк_РучноеИзменениеПараметровПакета.СерийныйНомер = ВТ_СкладШтабель.СерийныйНомер
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);	
	Запрос.УстановитьПараметр("Ссылка", РучноеИзменениеПараметров);
	Запрос.УстановитьПараметр("Период", РучноеИзменениеПараметров.Дата);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();  // РезультатЗапроса.Выгрузить()
			
	ТабЗапроса = РезультатЗапроса[0].Выгрузить();
	
	//добавляем колонку документ для доп параметры пакетов
	ТабЗапроса.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.алк_РучноеИзменениеПараметровПакета"));
	//\\
		
	Для каждого стрТаб Из ТабЗапроса Цикл
		стрТаб.НомерПакета = НоменклатураСервер.НомерСерии(стрТаб.СерийныйНомер);
		стрТаб.Документ = РучноеИзменениеПараметров; 
	КонецЦикла; 

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов", ТабЗапроса); 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеПараметрыПакетов", ТабЗапроса);

	Если РучноеИзменениеПараметров.Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", РезультатЗапроса[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", РезультатЗапроса[3].Выгрузить());
	КонецЕсли;
	
	
	
КонецПроцедуры

// не учитывается изменение характеристики
Процедура ИнициализироватьДанныеДокументаДо(РучноеИзменениеПараметров, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.НомерПакета,
	|	алк_РучноеИзменениеПараметровПакета.ПериодПакета,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC КАК СертификатFSC1,
	|	алк_РучноеИзменениеПараметровПакета.ОбъемТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1
	|	КОНЕЦ КАК ВесНеттоТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1
	|	КОНЕЦ КАК ВесБруттоТаможня,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC1 КАК СертификатFSC,
	|	алк_РучноеИзменениеПараметровПакета.ПериодУпаковки,
	|	&Период,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница1 КАК СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1.Владелец КАК Номенклатура,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав1 КАК Количество,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка1 КАК Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ) КАК ДатаСмены,
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияРасход,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика.Владелец,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ),
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка", РучноеИзменениеПараметров);
	Запрос.УстановитьПараметр("Период", РучноеИзменениеПараметров.Дата);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();  // РезультатЗапроса.Выгрузить()
	
	ТабЗапроса = РезультатЗапроса[0].Выгрузить();
	
	Для каждого стрТаб Из ТабЗапроса Цикл
		стрТаб.НомерПакета = НоменклатураСервер.НомерСерии(стрТаб.СерийныйНомер);	
	КонецЦикла; 

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов", ТабЗапроса);

	Если РучноеИзменениеПараметров.Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", РезультатЗапроса[1].Выгрузить());		
	КонецЕсли;
	
	
КонецПроцедуры
